
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/goda6565/lambda-bot/actions/runs/15232899199)



<pre><code>Apply complete! Resources: 19 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.lambda.data.aws_iam_policy_document.lambda_policy_document: Reading...
module.lambda.data.aws_iam_policy_document.lambda_policy_document: Read complete after 0s [id=2690255455]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.api_gateway.aws_apigatewayv2_api.lambda_api will be created
  + resource "aws_apigatewayv2_api" "lambda_api" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + ip_address_type              = (known after apply)
      + name                         = "lambda-bot-test-api"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_integration.lambda_integration will be created
  + resource "aws_apigatewayv2_integration" "lambda_integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = 30000
    }

  # module.api_gateway.aws_apigatewayv2_route.lambda_function_route will be created
  + resource "aws_apigatewayv2_route" "lambda_function_route" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /invoke"
      + target             = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_stage.lambda_function_invoke_stage will be created
  + resource "aws_apigatewayv2_stage" "lambda_function_invoke_stage" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags_all      = (known after apply)

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod   = "$context.httpMethod"
                  + ip           = "$context.identity.sourceIp"
                  + protocol     = "$context.protocol"
                  + requestId    = "$context.requestId"
                  + requestTime  = "$context.requestTime"
                  + responseTime = "$context.responseLatency"
                  + routeKey     = "$context.routeKey"
                  + status       = "$context.status"
                }
            )
        }
    }

  # module.api_gateway.aws_cloudwatch_log_group.api_gateway will be created
  + resource "aws_cloudwatch_log_group" "api_gateway" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/lambda-bot-test-api-gateway"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Name" = "/aws/lambda/lambda-bot-test-api-gateway"
        }
      + tags_all          = {
          + "Name" = "/aws/lambda/lambda-bot-test-api-gateway"
        }
    }

  # module.api_gateway.aws_lambda_permission.allow_apigateway will be created
  + resource "aws_lambda_permission" "allow_apigateway" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "lambda-bot-test"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = "test"
      + source_arn          = (known after apply)
      + statement_id        = "AllowInvokeFromApiGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.ecr.aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "lambda-bot-test"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "lambda-bot-test"
        }
      + tags_all             = {
          + "Name" = "lambda-bot-test"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.gemini_api_key.aws_secretsmanager_secret.secretsmanager_secret will be created
  + resource "aws_secretsmanager_secret" "secretsmanager_secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "gemini-api-key-test"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # module.gemini_api_key.aws_secretsmanager_secret_version.secretmanager_secret_version will be created
  + resource "aws_secretsmanager_secret_version" "secretmanager_secret_version" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.lambda.data.aws_iam_policy_document.lambda_secret_manager_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_secret_manager_policy_document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.lambda.aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/lambda-bot-test"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Name" = "/aws/lambda/lambda-bot-test"
        }
      + tags_all          = {
          + "Name" = "/aws/lambda/lambda-bot-test"
        }
    }

  # module.lambda.aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-bot-test-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.lambda.aws_iam_role_policy.lambda_secret_manager_policy will be created
  + resource "aws_iam_role_policy" "lambda_secret_manager_policy" {
      + id          = (known after apply)
      + name        = "lambda-bot-test-secret-manager-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.lambda.aws_iam_role_policy_attachment.lambda_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "lambda_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "lambda-bot-test-role"
    }

  # module.lambda.aws_lambda_alias.lambda will be created
  + resource "aws_lambda_alias" "lambda" {
      + arn              = (known after apply)
      + function_name    = "lambda-bot-test"
      + function_version = (known after apply)
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "test"
    }

  # module.lambda.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "lambda-bot-test"
      + id                             = (known after apply)
      + image_uri                      = "061051222129.dkr.ecr.ap-northeast-1.amazonaws.com/lambda-bot-prod:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "lambda-bot-test"
        }
      + tags_all                       = {
          + "Name" = "lambda-bot-test"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENV" = "test"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret will be created
  + resource "aws_secretsmanager_secret" "secretsmanager_secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "slack-bot-token-test"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # module.slack_bot_token.aws_secretsmanager_secret_version.secretmanager_secret_version will be created
  + resource "aws_secretsmanager_secret_version" "secretmanager_secret_version" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret will be created
  + resource "aws_secretsmanager_secret" "secretsmanager_secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "slack-signing-secret-test"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # module.slack_signing_secret.aws_secretsmanager_secret_version.secretmanager_secret_version will be created
  + resource "aws_secretsmanager_secret_version" "secretmanager_secret_version" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

Plan: 19 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_gateway_invoke_url = (known after apply)
module.ecr.aws_ecr_repository.ecr_repository: Creating...
module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret: Creating...
module.lambda.aws_cloudwatch_log_group.lambda: Creating...
module.lambda.aws_iam_role.lambda_role: Creating...
module.api_gateway.aws_apigatewayv2_api.lambda_api: Creating...
module.api_gateway.aws_cloudwatch_log_group.api_gateway: Creating...
module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret: Creating...
module.gemini_api_key.aws_secretsmanager_secret.secretsmanager_secret: Creating...
module.lambda.aws_iam_role.lambda_role: Creation complete after 1s [id=lambda-bot-test-role]
module.lambda.aws_iam_role_policy_attachment.lambda_role_policy_attachment: Creating...
module.gemini_api_key.aws_secretsmanager_secret.secretsmanager_secret: Creation complete after 1s [id=arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:gemini-api-key-test-VaGp90]
module.gemini_api_key.aws_secretsmanager_secret_version.secretmanager_secret_version: Creating...
module.lambda.aws_iam_role_policy_attachment.lambda_role_policy_attachment: Creation complete after 0s [id=lambda-bot-test-role-20250525013338827800000004]
module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret: Creation complete after 1s [id=arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-test-rebAK3]
module.slack_bot_token.aws_secretsmanager_secret_version.secretmanager_secret_version: Creating...
module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret: Creation complete after 1s [id=arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-test-iazSfZ]
module.slack_signing_secret.aws_secretsmanager_secret_version.secretmanager_secret_version: Creating...
module.lambda.data.aws_iam_policy_document.lambda_secret_manager_policy_document: Reading...
module.lambda.data.aws_iam_policy_document.lambda_secret_manager_policy_document: Read complete after 0s [id=1074828563]
module.lambda.aws_iam_role_policy.lambda_secret_manager_policy: Creating...
module.api_gateway.aws_cloudwatch_log_group.api_gateway: Creation complete after 1s [id=/aws/lambda/lambda-bot-test-api-gateway]
module.lambda.aws_cloudwatch_log_group.lambda: Creation complete after 1s [id=/aws/lambda/lambda-bot-test]
module.lambda.aws_lambda_function.lambda: Creating...
module.ecr.aws_ecr_repository.ecr_repository: Creation complete after 1s [id=lambda-bot-test]
module.lambda.aws_iam_role_policy.lambda_secret_manager_policy: Creation complete after 0s [id=lambda-bot-test-role:lambda-bot-test-secret-manager-policy]
module.slack_bot_token.aws_secretsmanager_secret_version.secretmanager_secret_version: Creation complete after 0s [id=arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-test-rebAK3|terraform-20250525013338921400000006]
module.gemini_api_key.aws_secretsmanager_secret_version.secretmanager_secret_version: Creation complete after 0s [id=arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:gemini-api-key-test-VaGp90|terraform-20250525013338901100000005]
module.slack_signing_secret.aws_secretsmanager_secret_version.secretmanager_secret_version: Creation complete after 0s [id=arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-test-iazSfZ|terraform-20250525013338930300000007]
module.api_gateway.aws_apigatewayv2_api.lambda_api: Creation complete after 2s [id=vyg7foq6j6]
module.api_gateway.aws_apigatewayv2_stage.lambda_function_invoke_stage: Creating...
module.api_gateway.aws_apigatewayv2_stage.lambda_function_invoke_stage: Creation complete after 1s [id=$default]
module.lambda.aws_lambda_function.lambda: Still creating... [00m10s elapsed]
module.lambda.aws_lambda_function.lambda: Creation complete after 19s [id=lambda-bot-test]
module.lambda.aws_lambda_alias.lambda: Creating...
module.lambda.aws_lambda_alias.lambda: Creation complete after 0s [id=arn:aws:lambda:ap-northeast-1:061051222129:function:lambda-bot-test:test]
module.api_gateway.aws_lambda_permission.allow_apigateway: Creating...
module.api_gateway.aws_apigatewayv2_integration.lambda_integration: Creating...
module.api_gateway.aws_lambda_permission.allow_apigateway: Creation complete after 1s [id=AllowInvokeFromApiGateway]
module.api_gateway.aws_apigatewayv2_integration.lambda_integration: Creation complete after 2s [id=j5vixh3]
module.api_gateway.aws_apigatewayv2_route.lambda_function_route: Creating...
module.api_gateway.aws_apigatewayv2_route.lambda_function_route: Creation complete after 0s [id=e7eonzt]

Apply complete! Resources: 19 added, 0 changed, 0 destroyed.

Outputs:

api_gateway_invoke_url = "https://vyg7foq6j6.execute-api.ap-northeast-1.amazonaws.com/"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":17,"Program":"tfcmt","SHA1":"92f67204acfad13d9172c0d1a1821adf5a90748c","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->